#include <stdio.h>

int main(void)
{
	//%	d指示为正值打印前导空格
	printf("%x %X %#x %#X\n\n", 65536, 65536, 65536, 65536);
	printf("*%d* *% d* *% d*\n\n", 42, 42, -42);

	//%05.3d指示打印十进制整数，最短长度为5，前导0填充保证显示3位数，出现-号或精度则忽略掉最高位用0填满字段宽度
	printf("*%5d* *%05d* *%5.3d* *%05.3d*\n\n", 1, 1, 1, 1);
	printf("*%5d* *%05d* *%5.3d* *%05.3d*\n\n", 12, 12, 12,12); 
	printf("*%5d* *%05d* *%5.3d* *%05.3d*\n\n", 123, 123, 123, 123);
	printf("*%5d* *%05d* *%5.3d* *%05.3d*\n\n", 1234, 1234, 1234, 1234); 
	printf("*%5d* *%05d* *%5.3d* *%05.3d*\n\n", 12345, 12345, 12345, 12345); 
	printf("*%5d* *%05d* *%5.3d* *%05.3d*\n\n", 123456, 123456, 123456, 123456); 

	getchar();
	return 0;
}