#include <stdio.h>

int data[2] = { 100, 200 };
int moredata[2] = { 300, 400 };


int main(void)
{
	int * p1, *p2, *p3;
	
	p1 = p2 = data;
	p3 = moredata;
	printf("  *p1 = %d,  *p2 = %d,  *p3 = %d\n",		//100； 100； 300 (各指针不变)
		*p1, *p2, *p3);
	printf("*p1++ = %d, *++p2 = %d, *(p3)++ = %d\n",	//100（后，p1加1）；（先，p2加1）200；（先，引用p3指向的值）300（后，p3加1）
		*p1++, *++p2, *(p3)++);
	printf("  *p1 = %d,  *p2 = %d,  *p3 = %d\n",		/*200(上一句中，引用完指向的值后，指针增加1指向下一个元素)； 
														200（上一句中，引用了指针加1的值、即下一个元素的值，指针指向下一个元素）；
														400（上一句中，引用了指针的值，然后指针增加1，指向下一个元素）*/
		*p1, *p2, *p3);

	getchar();
	return 0;
}